---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooSmallNumberOfBars
source: html/b145d39c-92b6-86c7-461a-889bfdd98d9b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooSmallNumberOfBars Property

Rebar Set must contain at least two bar locations.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooSmallNumberOfBars { get; }
```